Revit 2027 API
SlabShapeVertexArray.Append Method
Add the item to the end of the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Append(
	SlabShapeVertex item
)
Public Overridable Sub Append (
	item As SlabShapeVertex
)
public:
virtual void Append(
	SlabShapeVertex^ item
)
abstract Append :
        item : SlabShapeVertex -> unit
override Append :
        item : SlabShapeVertex -> unit
Parameters
item SlabShapeVertex
The item to be added.
See Also
Reference
SlabShapeVertexArray Class
Autodesk.Revit.DB Namespace